Ran Plan for dir: `production` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # local_file.ansible_inventory has been deleted
- resource "local_file" "ansible_inventory" {
      - content              = <<-EOT
            ---
            all:
              children:
                bastion:
                  hosts:
                    bastion:
                      ansible_host: 51.250.20.35
                  vars:
                    ansible_user: nedorezov
                hosts_control:
                  hosts:
                    controller-1.ru-central1.internal:
                      ansible_host: 10.0.1.14
                      ip: 10.0.1.14
                      access_ip: 10.0.1.14
                    controller-2.ru-central1.internal:
                      ansible_host: 10.0.2.22
                      ip: 10.0.2.22
                      access_ip: 10.0.2.22
                    controller-3.ru-central1.internal:
                      ansible_host: 10.0.3.14
                      ip: 10.0.3.14
                      access_ip: 10.0.3.14
                  vars:
                    ansible_user: nedorezov
                hosts_workers:
                  hosts:
                    worker-1.ru-central1.internal:
                      ansible_host: 10.0.1.15
                      ip: 10.0.1.15
                      access_ip: 10.0.1.15
                    worker-2.ru-central1.internal:
                      ansible_host: 10.0.2.25
                      ip: 10.0.2.25
                      access_ip: 10.0.2.25
                    worker-3.ru-central1.internal:
                      ansible_host: 10.0.3.34
                      ip: 10.0.3.34
                      access_ip: 10.0.3.34
                  vars:
                    ansible_user: nedorezov
                kube_control_plane:
                  children:
                    hosts_control:
                kube_node:
                  children:
                    hosts_workers:
                etcd:
                  children:
                    hosts_control:
                k8s_cluster:
                  children:
                    kube_control_plane:
                    kube_node:
        EOT -> null
        id                   = "030f69307d76c6f80f1b3266866affc001320f82"
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # local_file.ansible_inventory will be created
+ resource "local_file" "ansible_inventory" {
      + content              = <<-EOT
            ---
            all:
              children:
                bastion:
                  hosts:
                    bastion:
                      ansible_host: 51.250.20.35
                  vars:
                    ansible_user: nedorezov
                hosts_control:
                  hosts:
                    controller-1.ru-central1.internal:
                      ansible_host: 10.0.1.14
                      ip: 10.0.1.14
                      access_ip: 10.0.1.14
                    controller-2.ru-central1.internal:
                      ansible_host: 10.0.2.22
                      ip: 10.0.2.22
                      access_ip: 10.0.2.22
                    controller-3.ru-central1.internal:
                      ansible_host: 10.0.3.14
                      ip: 10.0.3.14
                      access_ip: 10.0.3.14
                  vars:
                    ansible_user: nedorezov
                hosts_workers:
                  hosts:
                    worker-1.ru-central1.internal:
                      ansible_host: 10.0.1.15
                      ip: 10.0.1.15
                      access_ip: 10.0.1.15
                    worker-2.ru-central1.internal:
                      ansible_host: 10.0.2.25
                      ip: 10.0.2.25
                      access_ip: 10.0.2.25
                    worker-3.ru-central1.internal:
                      ansible_host: 10.0.3.34
                      ip: 10.0.3.34
                      access_ip: 10.0.3.34
                  vars:
                    ansible_user: nedorezov
                kube_control_plane:
                  children:
                    hosts_control:
                kube_node:
                  children:
                    hosts_workers:
                etcd:
                  children:
                    hosts_control:
                k8s_cluster:
                  children:
                    kube_control_plane:
                    kube_node:
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./ansible/inventory.yml"
      + id                   = (known after apply)
    }

  # terraform_data.kubespray must be replaced
-/+ resource "terraform_data" "kubespray" {
      ~ id               = "2a703e48-dacc-be0a-c187-b7ca4baf85c2" -> (known after apply)
      ~ triggers_replace = <<-EOT
          - ---
          + ---
          - all:
          + all:
          -   children:
          +   children:
          -     bastion:
          +     bastion:
          -       hosts:
          +       hosts:
          -         bastion:
          +         bastion:
          -           ansible_host: 51.250.20.35
          +           ansible_host: 51.250.20.35
          -       vars:
          +       vars:
          -         ansible_user: nedorezov
          +         ansible_user: nedorezov
          -     hosts_control:
          +     hosts_control:
          -       hosts:
          +       hosts:
          -         controller-1.ru-central1.internal:
          +         controller-1.ru-central1.internal:
          -           ansible_host: 10.0.1.14
          +           ansible_host: 10.0.1.14
          -           ip: 10.0.1.14
          +           ip: 10.0.1.14
          -           access_ip: 10.0.1.14
          +           access_ip: 10.0.1.14
          -         controller-2.ru-central1.internal:
          +         controller-2.ru-central1.internal:
          -           ansible_host: 10.0.2.22
          +           ansible_host: 10.0.2.22
          -           ip: 10.0.2.22
          +           ip: 10.0.2.22
          -           access_ip: 10.0.2.22
          +           access_ip: 10.0.2.22
          -         controller-3.ru-central1.internal:
          +         controller-3.ru-central1.internal:
          -           ansible_host: 10.0.3.14
          +           ansible_host: 10.0.3.14
          -           ip: 10.0.3.14
          +           ip: 10.0.3.14
          -           access_ip: 10.0.3.14
          +           access_ip: 10.0.3.14
          -       vars:
          +       vars:
          -         ansible_user: nedorezov
          +         ansible_user: nedorezov
          -     hosts_workers:
          +     hosts_workers:
          -       hosts:
          +       hosts:
          -         worker-1.ru-central1.internal:
          +         worker-1.ru-central1.internal:
          -           ansible_host: 10.0.1.15
          +           ansible_host: 10.0.1.15
          -           ip: 10.0.1.15
          +           ip: 10.0.1.15
          -           access_ip: 10.0.1.15
          +           access_ip: 10.0.1.15
          -         worker-2.ru-central1.internal:
          +         worker-2.ru-central1.internal:
          -           ansible_host: 10.0.2.25
          +           ansible_host: 10.0.2.25
          -           ip: 10.0.2.25
          +           ip: 10.0.2.25
          -           access_ip: 10.0.2.25
          +           access_ip: 10.0.2.25
          -         worker-3.ru-central1.internal:
          +         worker-3.ru-central1.internal:
          -           ansible_host: 10.0.3.34
          +           ansible_host: 10.0.3.34
          -           ip: 10.0.3.34
          +           ip: 10.0.3.34
          -           access_ip: 10.0.3.34
          +           access_ip: 10.0.3.34
          -       vars:
          +       vars:
          -         ansible_user: nedorezov
          +         ansible_user: nedorezov
          -     kube_control_plane:
          +     kube_control_plane:
          -       children:
          +       children:
          -         hosts_control:
          +         hosts_control:
          -     kube_node:
          +     kube_node:
          -       children:
          +       children:
          -         hosts_workers:
          +         hosts_workers:
          -     etcd:
          +     etcd:
          -       children:
          +       children:
          -         hosts_control:
          +         hosts_control:
          -     k8s_cluster:
          +     k8s_cluster:
          -       children:
          +       children:
          -         kube_control_plane:
          +         kube_control_plane:
                    kube_node:
        EOT
    }

  # terraform_data.monitoring-helm must be replaced
-/+ resource "terraform_data" "monitoring-helm" {
      ~ id               = "f085d365-88a5-b1fb-a7aa-d8e0221d246a" -> (known after apply)
      ~ triggers_replace = <<-EOT
          - ---
          + ---
          - all:
          + all:
          -   children:
          +   children:
          -     bastion:
          +     bastion:
          -       hosts:
          +       hosts:
          -         bastion:
          +         bastion:
          -           ansible_host: 51.250.20.35
          +           ansible_host: 51.250.20.35
          -       vars:
          +       vars:
          -         ansible_user: nedorezov
          +         ansible_user: nedorezov
          -     hosts_control:
          +     hosts_control:
          -       hosts:
          +       hosts:
          -         controller-1.ru-central1.internal:
          +         controller-1.ru-central1.internal:
          -           ansible_host: 10.0.1.14
          +           ansible_host: 10.0.1.14
          -           ip: 10.0.1.14
          +           ip: 10.0.1.14
          -           access_ip: 10.0.1.14
          +           access_ip: 10.0.1.14
          -         controller-2.ru-central1.internal:
          +         controller-2.ru-central1.internal:
          -           ansible_host: 10.0.2.22
          +           ansible_host: 10.0.2.22
          -           ip: 10.0.2.22
          +           ip: 10.0.2.22
          -           access_ip: 10.0.2.22
          +           access_ip: 10.0.2.22
          -         controller-3.ru-central1.internal:
          +         controller-3.ru-central1.internal:
          -           ansible_host: 10.0.3.14
          +           ansible_host: 10.0.3.14
          -           ip: 10.0.3.14
          +           ip: 10.0.3.14
          -           access_ip: 10.0.3.14
          +           access_ip: 10.0.3.14
          -       vars:
          +       vars:
          -         ansible_user: nedorezov
          +         ansible_user: nedorezov
          -     hosts_workers:
          +     hosts_workers:
          -       hosts:
          +       hosts:
          -         worker-1.ru-central1.internal:
          +         worker-1.ru-central1.internal:
          -           ansible_host: 10.0.1.15
          +           ansible_host: 10.0.1.15
          -           ip: 10.0.1.15
          +           ip: 10.0.1.15
          -           access_ip: 10.0.1.15
          +           access_ip: 10.0.1.15
          -         worker-2.ru-central1.internal:
          +         worker-2.ru-central1.internal:
          -           ansible_host: 10.0.2.25
          +           ansible_host: 10.0.2.25
          -           ip: 10.0.2.25
          +           ip: 10.0.2.25
          -           access_ip: 10.0.2.25
          +           access_ip: 10.0.2.25
          -         worker-3.ru-central1.internal:
          +         worker-3.ru-central1.internal:
          -           ansible_host: 10.0.3.34
          +           ansible_host: 10.0.3.34
          -           ip: 10.0.3.34
          +           ip: 10.0.3.34
          -           access_ip: 10.0.3.34
          +           access_ip: 10.0.3.34
          -       vars:
          +       vars:
          -         ansible_user: nedorezov
          +         ansible_user: nedorezov
          -     kube_control_plane:
          +     kube_control_plane:
          -       children:
          +       children:
          -         hosts_control:
          +         hosts_control:
          -     kube_node:
          +     kube_node:
          -       children:
          +       children:
          -         hosts_workers:
          +         hosts_workers:
          -     etcd:
          +     etcd:
          -       children:
          +       children:
          -         hosts_control:
          +         hosts_control:
          -     k8s_cluster:
          +     k8s_cluster:
          -       children:
          +       children:
          -         kube_control_plane:
          +         kube_control_plane:
                    kube_node:
        EOT
    }

  # yandex_compute_instance.bastion will be updated in-place
~ resource "yandex_compute_instance" "bastion" {
        id                        = "epdeju89f6t96f0h4co1"
      ~ metadata                  = {
          ~ "user-data" = <<-EOT
              - #cloud-config
              + #cloud-config
              - users:
              + users:
              -   - name: nedorezov
              +   - name: nedorezov
              -     groups: sudo
              +     groups: sudo
              -     shell: /bin/bash
              +     shell: /bin/bash
              -     sudo: ['ALL=(ALL) NOPASSWD:ALL']
              +     sudo: ['ALL=(ALL) NOPASSWD:ALL']
              -     ssh_authorized_keys:
              +     ssh_authorized_keys:
                      - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKWdwZ3ITR9ceNI5R/BcOHUf9H3G/i/u2MkOGk945cUI nedorezov@GARRO
              - 
              + 
              - package_update: false
              + package_update: false
              - package_upgrade: false
              + package_upgrade: false
              - packages: ["vim","net-tools"]
              + packages: ["vim","net-tools"]
              - bootcmd:
              + bootcmd:
              -   - sudo apt-get remove unattended-upgrades
              +   - sudo apt-get remove unattended-upgrades
              -   - sudo systemctl stop apt-daily.timer
              +   - sudo systemctl stop apt-daily.timer
              -   - sudo systemctl disable apt-daily.timer
              +   - sudo systemctl disable apt-daily.timer
              -   - sudo systemctl stop apt-daily-upgrade.timer
              +   - sudo systemctl stop apt-daily-upgrade.timer
              -   - sudo systemctl disable apt-daily-upgrade.timer
              +   - sudo systemctl disable apt-daily-upgrade.timer
              -   - sudo systemctl disable apt-daily.service
              +   - sudo systemctl disable apt-daily.service
                  - sudo systemctl daemon-reload
            EOT
        }
        name                      = "bastion"
        # (14 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # yandex_compute_instance_group.control-plane will be updated in-place
~ resource "yandex_compute_instance_group" "control-plane" {
        id                  = "cl1vc252p1f55fvpr81e"
        name                = "k8s-control-plane"
        # (9 unchanged attributes hidden)

      ~ instance_template {
          ~ metadata           = {
              ~ "user-data"          = <<-EOT
                  - #cloud-config
                  + #cloud-config
                  - users:
                  + users:
                  -   - name: nedorezov
                  +   - name: nedorezov
                  -     groups: sudo
                  +     groups: sudo
                  -     shell: /bin/bash
                  +     shell: /bin/bash
                  -     sudo: ['ALL=(ALL) NOPASSWD:ALL']
                  +     sudo: ['ALL=(ALL) NOPASSWD:ALL']
                  -     ssh_authorized_keys:
                  +     ssh_authorized_keys:
                          - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKWdwZ3ITR9ceNI5R/BcOHUf9H3G/i/u2MkOGk945cUI nedorezov@GARRO
                  - 
                  + 
                  - package_update: false
                  + package_update: false
                  - package_upgrade: false
                  + package_upgrade: false
                  - packages: ["vim","net-tools"]
                  + packages: ["vim","net-tools"]
                  - bootcmd:
                  + bootcmd:
                  -   - sudo apt-get remove unattended-upgrades
                  +   - sudo apt-get remove unattended-upgrades
                  -   - sudo systemctl stop apt-daily.timer
                  +   - sudo systemctl stop apt-daily.timer
                  -   - sudo systemctl disable apt-daily.timer
                  +   - sudo systemctl disable apt-daily.timer
                  -   - sudo systemctl stop apt-daily-upgrade.timer
                  +   - sudo systemctl stop apt-daily-upgrade.timer
                  -   - sudo systemctl disable apt-daily-upgrade.timer
                  +   - sudo systemctl disable apt-daily-upgrade.timer
                  -   - sudo systemctl disable apt-daily.service
                  +   - sudo systemctl disable apt-daily.service
                      - sudo systemctl daemon-reload
                EOT
                # (1 unchanged element hidden)
            }
            name               = "controller-{instance.index}"
            # (5 unchanged attributes hidden)

            # (5 unchanged blocks hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # yandex_compute_instance_group.worker will be updated in-place
~ resource "yandex_compute_instance_group" "worker" {
        id                  = "cl11uegp80cikvm2sv3a"
        name                = "k8s-workers"
        # (9 unchanged attributes hidden)

      ~ instance_template {
          ~ metadata           = {
              ~ "user-data"          = <<-EOT
                  - #cloud-config
                  + #cloud-config
                  - users:
                  + users:
                  -   - name: nedorezov
                  +   - name: nedorezov
                  -     groups: sudo
                  +     groups: sudo
                  -     shell: /bin/bash
                  +     shell: /bin/bash
                  -     sudo: ['ALL=(ALL) NOPASSWD:ALL']
                  +     sudo: ['ALL=(ALL) NOPASSWD:ALL']
                  -     ssh_authorized_keys:
                  +     ssh_authorized_keys:
                          - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKWdwZ3ITR9ceNI5R/BcOHUf9H3G/i/u2MkOGk945cUI nedorezov@GARRO
                  - 
                  + 
                  - package_update: false
                  + package_update: false
                  - package_upgrade: false
                  + package_upgrade: false
                  - packages: ["vim","net-tools"]
                  + packages: ["vim","net-tools"]
                  - bootcmd:
                  + bootcmd:
                  -   - sudo apt-get remove unattended-upgrades
                  +   - sudo apt-get remove unattended-upgrades
                  -   - sudo systemctl stop apt-daily.timer
                  +   - sudo systemctl stop apt-daily.timer
                  -   - sudo systemctl disable apt-daily.timer
                  +   - sudo systemctl disable apt-daily.timer
                  -   - sudo systemctl stop apt-daily-upgrade.timer
                  +   - sudo systemctl stop apt-daily-upgrade.timer
                  -   - sudo systemctl disable apt-daily-upgrade.timer
                  +   - sudo systemctl disable apt-daily-upgrade.timer
                  -   - sudo systemctl disable apt-daily.service
                  +   - sudo systemctl disable apt-daily.service
                      - sudo systemctl daemon-reload
                EOT
                # (1 unchanged element hidden)
            }
            name               = "worker-{instance.index}"
            # (5 unchanged attributes hidden)

            # (5 unchanged blocks hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 3 to add, 3 to change, 2 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.smutosey.ru/lock?id=smutosey%252Fdevops-diplom-infra%252Fproduction%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d production
  ```

**Note: Objects have changed outside of Terraform**
Plan: 3 to add, 3 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```